{
  "backend/main.mo": "Minimal Motoko backend actor with no methods or state defined.",
  "feature_evidence.json": "Feature evidence report documenting that the LinkedIn profile photo was downloaded and saved as a local static asset, and HeroSection was updated to use it.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file for build planning reference.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark color themes.",
  "frontend/index.html": "HTML entry point that loads Inter and Merriweather fonts from Google Fonts and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that assembles all CV sections with TopNav and a personalized footer message from Vibhanshu.",
  "frontend/src/components/cv/ContactSection.tsx": "Renders a grid of contact method cards (email, phone, LinkedIn, Google Drive, website, Twitter) filtered to only show items with valid hrefs.",
  "frontend/src/components/cv/EducationSection.tsx": "Displays a list of education entries as cards with degree, institution, dates, location, and optional bullet-point details.",
  "frontend/src/components/cv/ExperienceSection.tsx": "Renders a vertical timeline of work experience entries with role, company, optional location, and description bullet points.",
  "frontend/src/components/cv/HeroSection.tsx": "Hero section displaying the profile photo (with fallback to the local generated asset), name, title, location, summary, and CTA buttons for contact and projects.",
  "frontend/src/components/cv/ProjectsSection.tsx": "Displays a responsive grid of project cards with title, description, technology badges, and links to live demo and GitHub.",
  "frontend/src/components/cv/Section.tsx": "Reusable section wrapper that applies consistent padding, max-width, and a styled heading to any CV section.",
  "frontend/src/components/cv/SkillsSection.tsx": "Renders skill categories in a two-column grid, each card listing skills as styled badge spans.",
  "frontend/src/components/cv/TopNav.tsx": "A fixed top navigation bar component with smooth-scroll links to CV sections, active section highlighting via scroll detection, and a responsive mobile hamburger menu.",
  "frontend/src/data/cv.ts": "Defines TypeScript interfaces for all CV data structures and exports a static `cvData` object containing Vibhanshu Meshram's hero, experience, education, skills, projects, and contact information.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using an anonymous actor when unauthenticated or an identity-bound actor when logged in, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "An intentionally empty placeholder file noting that no backend queries are needed since all CV data comes from the static data file.",
  "frontend/src/hooks/useSeoFromCvData.ts": "A hook that dynamically sets the document title and injects meta tags (description, Open Graph, Twitter Card) based on the CV hero data for SEO purposes.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining a warm earthy OKLCH color palette with CSS custom properties for both light and dark modes, plus base body and HTML styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider` into the DOM root.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based colors, font families, border radii, box shadows, accordion animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking the current version, existing features, and the active task of downloading a LinkedIn profile photo and using it as a local static asset in the HeroSection component."
}