{
  "backend/main.mo": "Minimal Motoko backend actor with no methods or state defined.",
  "feature_evidence.json": "Feature evidence report specifying that HeroSection.tsx should replace its profile image src with a LinkedIn CDN URL while retaining existing alt text, className, and error handling.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and notable recent changes for the Vibhanshu Meshram CV project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, and sidebar tokens.",
  "frontend/index.html": "HTML shell that mounts the React app at #root and preloads Inter and Merriweather fonts from Google Fonts.",
  "frontend/src/App.tsx": "Root React component that assembles all CV sections (Hero, Experience, Education, Skills, Projects, Contact) with TopNav and a personalized footer for Vibhanshu Meshram.",
  "frontend/src/components/cv/ContactSection.tsx": "Renders a grid of clickable contact cards (email, phone, LinkedIn, Google Drive, website, Twitter) filtered to only show items with valid hrefs.",
  "frontend/src/components/cv/EducationSection.tsx": "Displays a list of education entries as cards showing degree, institution, date range, optional location, and bullet-point details.",
  "frontend/src/components/cv/ExperienceSection.tsx": "Renders a vertical timeline of work experience entries with role, company, optional location, and bullet-point descriptions.",
  "frontend/src/components/cv/HeroSection.tsx": "Hero section displaying a profile photo sourced from data.profilePhoto with a local asset fallback on error, plus name, title, location, summary, and scroll-to-section buttons.",
  "frontend/src/components/cv/ProjectsSection.tsx": "Renders a responsive grid of project cards each showing title, description, technology badges, and optional live demo and GitHub links.",
  "frontend/src/components/cv/Section.tsx": "Generic section wrapper that applies consistent padding, max-width, and a styled h2 heading to any CV section.",
  "frontend/src/components/cv/SkillsSection.tsx": "Displays skill categories in a two-column card grid with badge-style skill tags styled using the primary color.",
  "frontend/src/components/cv/TopNav.tsx": "A fixed top navigation bar component with smooth-scroll links to CV sections, active section highlighting based on scroll position, and a responsive mobile hamburger menu.",
  "frontend/src/data/cv.ts": "Defines TypeScript interfaces for all CV data structures and exports a static `cvData` object containing Vibhanshu Meshram's hero, experience, education, skills, projects, and contact information.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using an anonymous actor when unauthenticated or an identity-bound actor when logged in, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "An intentionally empty placeholder file noting that no backend queries are needed since all CV data is sourced statically.",
  "frontend/src/hooks/useSeoFromCvData.ts": "A hook that dynamically sets the document title and injects/updates meta tags (description, Open Graph, Twitter Card) based on the provided CV hero data.",
  "frontend/src/index.css": "Global Tailwind CSS entry point defining a warm earthy OKLCH-based design token palette for both light and dark modes, plus base body and HTML styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider` into the DOM root.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH color tokens, font families, border radii, box shadows, accordion animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version, existing features, and a completed feature request to replace the Hero section profile photo src with an external LinkedIn image URL."
}