{
  "backend/main.mo": "Minimal Motoko backend actor with no defined methods or state, serving as a placeholder entry point.",
  "feature_evidence.json": "Feature evidence report linking the LinkedIn profile photo download and HeroSection.tsx update task to its relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence summaries of each frontend source file, describing their roles in the CV application.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark color themes.",
  "frontend/index.html": "HTML entry point that loads the React app, sets basic meta tags, and preconnects to Google Fonts for Inter and Merriweather.",
  "frontend/src/App.tsx": "Root React component that assembles all CV sections with a top navigation and a personalized footer message from Vibhanshu.",
  "frontend/src/components/cv/ContactSection.tsx": "Renders a grid of contact method cards (email, phone, LinkedIn, Google Drive, website, Twitter) filtered to only show items with valid hrefs.",
  "frontend/src/components/cv/EducationSection.tsx": "Displays a list of education entries as cards showing degree, institution, dates, location, and optional bullet-point details.",
  "frontend/src/components/cv/ExperienceSection.tsx": "Renders a vertical timeline of work experience entries with role, company, optional location, and bullet-point descriptions.",
  "frontend/src/components/cv/HeroSection.tsx": "Hero section displaying a profile photo (with fallback to the local generated asset), name, title, location, summary, and scroll-to action buttons.",
  "frontend/src/components/cv/ProjectsSection.tsx": "Renders a responsive grid of project cards with title, description, technology badges, and links to live demos and GitHub repositories.",
  "frontend/src/components/cv/Section.tsx": "Generic section wrapper component that applies consistent padding, max-width, and a styled heading to any CV section.",
  "frontend/src/components/cv/SkillsSection.tsx": "Displays skill categories in a two-column grid of cards, each listing individual skills as styled badge spans.",
  "frontend/src/components/cv/TopNav.tsx": "A fixed top navigation bar with smooth-scroll links to CV sections, active section highlighting based on scroll position, and a responsive mobile hamburger menu.",
  "frontend/src/data/cv.ts": "Defines TypeScript interfaces and static data for the CV, including hero, experience, education, skills, projects, and contact sections for Vibhanshu Meshram.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using the current Internet Identity if authenticated or an anonymous actor otherwise, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "An intentionally empty placeholder file noting that no backend queries are needed since all CV data is sourced statically.",
  "frontend/src/hooks/useSeoFromCvData.ts": "A hook that dynamically sets the document title and injects meta tags (description, Open Graph, Twitter Card) based on CV hero data for SEO purposes.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining a warm earthy OKLCH color palette with CSS custom properties for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based color tokens, custom fonts, border radii, shadows, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version, features, and requirements; records that the profile photo was downloaded from LinkedIn and saved as a static asset."
}