{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report describing an update to two Contact section text nodes.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files and their roles in the CV site.",
  "frontend/index.css": "Tailwind base and utility layers with custom OKLCH color variables and dark‑mode themes.",
  "frontend/index.html": "HTML entry point setting up meta tags, fonts, and root mount for the React app.",
  "frontend/src/App.tsx": "Main React app composing all CV sections, applying SEO, and rendering a custom footer.",
  "frontend/src/components/cv/ContactSection.tsx": "Renders contact methods as interactive cards; Google Drive item labeled 'Projects' with value 'Google Drive'.",
  "frontend/src/components/cv/EducationSection.tsx": "Displays education entries with degree, institution, dates, location, and optional details.",
  "frontend/src/components/cv/ExperienceSection.tsx": "Timeline-style work experience list with role, company, location, and bullet descriptions.",
  "frontend/src/components/cv/HeroSection.tsx": "Hero banner with background image, profile photo, name, title, summary, and CTA buttons.",
  "frontend/src/components/cv/ProjectsSection.tsx": "Grid of project cards with descriptions, technologies, and links to demos and GitHub.",
  "frontend/src/components/cv/Section.tsx": "Reusable layout wrapper enforcing consistent spacing and titles for sections.",
  "frontend/src/components/cv/SkillsSection.tsx": "Displays categorized skills with styled badges in a responsive grid.",
  "frontend/src/components/cv/TopNav.tsx": "Responsive navigation bar with scroll-based active section tracking and mobile menu toggle.",
  "frontend/src/data/cv.ts": "Defines CV-related TypeScript interfaces and provides static CV data for the site.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity authentication using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend query hooks; currently unused.",
  "frontend/src/hooks/useSeoFromCvData.ts": "Updates document title and meta tags based on CV data for SEO and social previews.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines custom OKLCH color variables and theme settings.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Tracks project state, features, and pending UI label update requests."
}