{
  "backend/main.mo": "Defines an empty Motoko actor with no logic.",
  "feature_evidence.json": "JSON report stub declaring a feature evidence report with no features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all major frontend files in the CV application.",
  "frontend/index.css": "Tailwind base and utilities with extensive OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and mounting the root React app.",
  "frontend/src/App.tsx": "Main React app composing all CV sections with navigation, SEO hook, and a custom footer.",
  "frontend/src/components/cv/ContactSection.tsx": "Renders a grid of contact methods with icons and links filtered from provided contact data.",
  "frontend/src/components/cv/EducationSection.tsx": "Displays education entries with degree, institution, dates, location, and optional bullet details.",
  "frontend/src/components/cv/ExperienceSection.tsx": "Renders a vertical timeline of work experience with role, company, dates, and bullet descriptions.",
  "frontend/src/components/cv/HeroSection.tsx": "Hero header showing profile image, name, title, summary, and CTA buttons with background image.",
  "frontend/src/components/cv/ProjectsSection.tsx": "Shows project cards with descriptions, technologies, and links to demos and source code.",
  "frontend/src/components/cv/Section.tsx": "Reusable layout wrapper that standardizes section spacing and typography.",
  "frontend/src/components/cv/SkillsSection.tsx": "Displays categorized skill groups with badge-style tags.",
  "frontend/src/components/cv/TopNav.tsx": "Responsive top navigation bar with scroll-based active section highlighting and mobile menu toggle.",
  "frontend/src/data/cv.ts": "Defines CV-related TypeScript interfaces and provides static CV data including hero, experience, education, skills, projects, and contact info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to user identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for future backend query hooks; currently unused.",
  "frontend/src/hooks/useSeoFromCvData.ts": "Updates document title and meta tags using hero CV data for SEO and social sharing.",
  "frontend/src/index.css": "Tailwind base styles with custom OKLCH color variables, dark mode settings, and global layout rules.",
  "frontend/src/main.tsx": "Application entry point initializing React, Internet Identity provider, React Query client, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing current requirements, issues, and pending tasks related to applying a profile photo."
}