{
  "backend/main.mo": "Defines an empty Motoko actor with no functionality.",
  "feature_evidence.json": "JSON feature evidence report referencing removal of the date‑range UI block in ExperienceSection.tsx.",
  "frontend-file-summaries.txt": "Lists brief summaries of various frontend CV components, data modules, hooks, and configuration files.",
  "frontend/index.css": "Tailwind base styles and extensive OKLCH color variables for light and dark themes with global styling rules.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, and mounting the React root with main.tsx.",
  "frontend/src/App.tsx": "Main React app composing all CV sections, applying SEO, and rendering a personalized footer.",
  "frontend/src/components/cv/ContactSection.tsx": "Renders a grid of contact methods with icons and links, including updated Google Drive label.",
  "frontend/src/components/cv/EducationSection.tsx": "Displays education entries with degree, institution, dates, location, and bullet‑point details.",
  "frontend/src/components/cv/ExperienceSection.tsx": "Renders a timeline of experience entries without the date‑range UI block and supports optional location.",
  "frontend/src/components/cv/HeroSection.tsx": "Hero banner showing profile photo, name, title, location, summary, and CTA buttons.",
  "frontend/src/components/cv/ProjectsSection.tsx": "Displays project cards with descriptions, technologies, and links to demos and GitHub code.",
  "frontend/src/components/cv/Section.tsx": "Reusable wrapper component providing consistent section layout and titles.",
  "frontend/src/components/cv/SkillsSection.tsx": "Renders categorized skills using tag‑style badges within a styled grid.",
  "frontend/src/components/cv/TopNav.tsx": "Responsive top navigation bar with scroll-based active section highlighting and mobile menu toggle.",
  "frontend/src/data/cv.ts": "Defines CV-related TypeScript interfaces and provides static CV data including hero, experience, education, skills, projects, and contact info.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are required for the CV site.",
  "frontend/src/hooks/useSeoFromCvData.ts": "Updates document title and meta tags for SEO and social sharing using CV data.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark themes with an earthy color palette.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata containing state, issues, and feature definitions for build and deployment tracking."
}