{
  "backend/main.mo": "Minimal Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing implemented CV UI updates and associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend CV components, data modules, and configuration files.",
  "frontend/index.css": "Global Tailwind setup defining OKLCH-based color variables and styling for light/dark themes.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and mounting the React app.",
  "frontend/src/App.tsx": "Main React component assembling all CV sections and rendering an updated personalized footer message.",
  "frontend/src/components/cv/ContactSection.tsx": "Renders contact methods in a card grid, including updated 'Google Drive (Projects)' label.",
  "frontend/src/components/cv/EducationSection.tsx": "Displays education entries with institution, dates, location, and optional details.",
  "frontend/src/components/cv/ExperienceSection.tsx": "Renders a timeline-style experience list with roles, companies, dates, and descriptions.",
  "frontend/src/components/cv/HeroSection.tsx": "Hero header with background, profile photo, name, title, location, summary, and CTA buttons.",
  "frontend/src/components/cv/ProjectsSection.tsx": "Shows project cards with descriptions, tech tags, and links to demos and repositories.",
  "frontend/src/components/cv/Section.tsx": "Reusable layout wrapper providing consistent section structure and spacing.",
  "frontend/src/components/cv/SkillsSection.tsx": "Displays categorized skill groups styled as clickable badges.",
  "frontend/src/components/cv/TopNav.tsx": "Responsive navigation bar that tracks active scroll section and provides smooth scrolling for desktop and mobile.",
  "frontend/src/data/cv.ts": "Defines CV-related TypeScript interfaces and exports static CV data including hero, experience, education, skills, projects, and contact.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query and invalidates dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and related state management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend query hooks; currently unused.",
  "frontend/src/hooks/useSeoFromCvData.ts": "Updates document title and meta tags for SEO based on CV data.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, color palettes, dark mode overrides, and base styling.",
  "frontend/src/main.tsx": "Application entry point that initializes React, React Query, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, breakpoints, animations, and plugin integrations.",
  "project_state.json": "Defines the project's current state, existing features, and pending feature requests involving profile photo updates, Google Drive label changes, and footer text replacement. Includes metadata like schema version, requirements, and project name."
}