{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report linking a profile photo update to the HeroSection component.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing their roles in the CV site.",
  "frontend/index.css": "Tailwind base styles defining extensive OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Main React layout composing all CV sections and footer while applying SEO metadata.",
  "frontend/src/components/cv/ContactSection.tsx": "Renders a contact grid with icons, links, and labels including email, phone, and social profiles.",
  "frontend/src/components/cv/EducationSection.tsx": "Displays education entries with degree, institution, dates, location, and optional details.",
  "frontend/src/components/cv/ExperienceSection.tsx": "Timeline-style work experience list showing roles, companies, locations, and bullet descriptions.",
  "frontend/src/components/cv/HeroSection.tsx": "Hero banner with name, title, summary, updated LinkedIn profile photo, and CTA buttons.",
  "frontend/src/components/cv/ProjectsSection.tsx": "Shows project cards with descriptions, tech tags, and links to live demos and GitHub.",
  "frontend/src/components/cv/Section.tsx": "Generic layout wrapper providing section spacing, titles, and container styling.",
  "frontend/src/components/cv/SkillsSection.tsx": "Lists skill categories with styled badge-like tags for each skill.",
  "frontend/src/components/cv/TopNav.tsx": "Responsive top navigation bar with scroll-based active section highlighting and smooth scrolling.",
  "frontend/src/data/cv.ts": "Defines TypeScript interfaces and static CV data including hero, experience, education, skills, projects, and contact info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are needed for the static CV site.",
  "frontend/src/hooks/useSeoFromCvData.ts": "Updates document title and meta tags based on CV hero data for SEO and social sharing.",
  "frontend/src/index.css": "Global Tailwind styles and theme variables defining colors, typography, and base styling.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Describes project state, features, and pending request to update the Hero section profile photo."
}